{
  "@context": [
    "https://www.w3.org/ns/activitystreams",
    "https://w3id.org/security/v1",
    "https://scottstolz.com/apschema/v1.10"
  ],
  "type": "Note",
  "id": "https://scottstolz.com/item/c1b41529-5ef1-416e-b8f5-8204016d3795",
  "diaspora:guid": "c1b41529-5ef1-416e-b8f5-8204016d3795",
  "published": "2023-01-30T04:00:13Z",
  "commentPolicy": "authenticated",
  "attributedTo": "https://scottstolz.com/channel/scott",
  "content": "<div id=\"shared_container_1775716989\" class=\"shared_container\"> <div id=\"shared_header_1775716989\" class=\"shared_header\"><a href=\"https://masto.ai/@stavvers\" ><img src=\"https://scottstolz.com/photo/2cc2db21-0c6b-4f8b-b288-fc3ba306ae63-6\" alt=\"Another Angry Woman\" height=\"32\" width=\"32\" loading=\"lazy\" /></a><span><a href=\"https://masto.ai/@stavvers\" ><bdi>Another Angry Woman</bdi></a> wrote the following <a href=\"https://masto.ai/@stavvers/109743922413395871\" >post</a> <span class=\"autotime\" title=\"2023-01-25T05:05:10-05:00\" >Wed, 25 Jan 2023 05:05:10 -0500</span></span></div><div id=\"reshared-content-1775716989\" class=\"reshared-content\"><img style=\"max-width: 100%;\" src=\"https://s3.masto.ai/media_attachments/files/109/743/909/795/295/144/original/f1c34ad0b539cbb2.png\" alt=\"Back at the window the teller notices his name on the withdrawal slipdoesn&#039;t match the name on the account so she asks for his ID. He once again tells her all the relevant infois on the folded note but also gives her his ID and says it&#039;s his dad&#039;s <br />account. She tells him he will need a check from his dad to get cash. He grabs the note and leaves. Two new robbery notifications hit ouremails, both branches within a mile. It&#039;s our guy. Security department is notified as are local police and the FBI. <br />The FBI comes over believing that these poor tellers had been robbed for the 3rd time in a month and take her statement. She is completely embarrassed telling them how everything went down and he kept signaling to the note and telling her to read it but <br />she was Just done. To which this FBI agent of 40 years who has been to the scene of many bank robberies (several at this branch i recent weeks) says: Ok. Let me see f I got thisright, he came in fully intending to rob you. He gave you the note and you <br />Just..refused to read it? So heleft and went o the bank literally across the street, handed them the exact same note, and they Just handed him five grand? Do I have that correct?” Her: I am so embarrassed FBI: this is best thing | have ever heard. He <br />even handed you his ID! Holy- Her: I feel so dumb! FBI: don&#039;t! This s the best thing I have ever heard. This is going to be in training courses. (He sat there giddy for at least 5 more minutes)\" title=\"Back at the window the teller notices his name on the withdrawal slip doesn&#039;t match the name on the account so she asks for his ID. He once again tells her all the relevant info is on the folded note but also gives her his ID and says it&#039;s his dad&#039;s <br />account. She tells him he will need a check from his dad to get cash. He grabs the note and leaves. Two new robbery notifications hit our emails, both branches within a mile. It&#039;s our guy. Security department is notified as are local police and the FBI. <br />The FBI comes over believing that these poor tellers had been robbed for the 3rd time in a month and take her statement. She is completely embarrassed tellingthem how everything went down and he kept signaling to the note and telling her to read it but <br />she was Just done. To which this FBI agent of 40 years who has been to the scene of many bank robberies (several at this branch i recent weeks) says: Ok. Let me see f I got this right, he came in fully intending to rob you. He gave you the note and you <br />Just..refused to read it? So he left and went o the bank literally across the street, handed them the exact same note, and they Just handed him five grand? Do I have that correct?” Her: I am so embarrassed FBI: this is best thing | have ever heard. He <br />even handed you his ID! Holy- Her: I feel so dumb! FBI: don&#039;t! This s the best thing I have ever heard. This is going to be in training courses. (He sat there giddy for at least 5 more minutes)\" loading=\"eager\" /><br /><img style=\"max-width: 100%;\" src=\"https://s3.masto.ai/media_attachments/files/109/743/904/596/287/946/original/5333a204612b8042.png\" alt=\"theprofessional-amateur: I worked as a bank teller for several years and a few things you should know, bank robberies happen far more frequently than you might think and they come in waves. When a bank gets robbed a notification with photos goes to all <br />banks in the area to be on the lookout. And there are two kinds of robbery, the pass the note and the takeover (what you see in movies). So our branch had had a big takeover robbery as well as a note one. We also had a teller that had transferred to our <br />branch after having been through a robbery. She was sweet as apple pie, hair up to the ceiling, southern lady who had just been through multiple robberies. A guy comes in and hands her afolded note. Her immediate thought was “this guy needs to learn <br />you don’t hand bank tellers notes. | am just not going to read that” So how the conversation goes: Her: how can I help you today? Him: I&#039;m here to getmoney Her: great *hands him a withdrawal slip Him: all the information is on the paper Her: to <br />process thetransaction I need you to put it on my piece of paper SO HE FILLS OUT A WITHDRAWAL SLIP. Meanwhile another coworker is looking at her latest robbery notification email thinking the guy at the window looks a lot like him but the teller is calm <br />and seems to be following standard transaction.\" title=\"theprofessional-amateur: I worked as a bank teller for several years and a few things you should know, bank robberies happen far more frequentlythan you might think and they come in waves. When a bank gets robbed a notification with photos goes to all <br />banks in the area to be on the lookout. And there are two kinds of robbery, the pass the note and the takeover (what you see in movies). So our branch had had a big takeover robbery as well as a note one. We also had a teller that had transferred to our <br />branch after having been through a robbery. She was sweet as apple pie, hair up to the ceiling, southern lady who had just been through multiple robberies. A guy comes in and hands her a folded note. Her immediate thought was “this guy needs to learn <br />you don’t hand bank tellers notes. | am just not going to read that” So how the conversation goes: Her: how can I help you today? Him: I&#039;m here to get money Her: great *hands him a withdrawal slip Him: all the information is on the paper Her: to <br />process the transaction I need you to put it on my piece of paper SO HE FILLS OUT A WITHDRAWAL SLIP. Meanwhile another coworker is looking at her latest robbery notification email thinking the guy at the window looks a lot like him but the teller is calm <br />and seems to be following standard transaction.\" loading=\"eager\" /><br /><img style=\"max-width: 100%;\" src=\"https://s3.masto.ai/media_attachments/files/109/743/838/783/142/620/original/58a22d1c6326e34e.jpeg\" alt=\"juicedoesthings: Remember if you&#039;re out at a store and someone says “This is a robbery” you can say “no it’s not” and then the robber will leave because theyre a robber and this is no longer a robbery juicedoesthings: screenshotted tags from <br />alonelybeemakingart #This is obviously a joke but #a coworker of my father kinda did this #(unintentionally) #And it worked You can not just say this without dropping the whole story alonelybeemakingart: Ok so, My dads coworker is at the front and this <br />man comes Up and hands him a document.The coworker took a Look at the document and while he couldn&#039;t read the things written by Hand, because he wasn&#039;t wearing his glases, he did notice the Logo of a different Bank so he&#039;s like: &quot;Oh, sorry siryou can&#039;t <br />do that here! You have to go to the other Bank for this :)&quot; The man, visibly confused leaves, but dosen&#039;t take the document with him. The coworker, now just as confused as the Guy actually TakesOut his glases and reads the hand written part: This is a <br />robbery gay-jesus-probably: Can you imagine trying to rob a god damn bank and the teller just cheerfully tells you to go rob the competition instead\" title=\"juicedoesthings: Remember if you&#039;re out at a store and someone says “This is a robbery” you can say “no it’s not” and then the robber will leave because theyre a robber and this is no longer a robbery juicedoesthings: screenshotted tags from <br />alonelybeemakingart #This is obviously a joke but #a coworker of my father kinda did this #(unintentionally) #And it worked You can not just say this without dropping the whole story alonelybeemakingart: Ok so, My dads coworker is at the front and this <br />man comes Up and hands him a document. The coworker took a Look at the document and while he couldn&#039;t read the things written by Hand, because he wasn&#039;t wearing his glases, he did notice the Logo of a different Bank so he&#039;s like: &quot;Oh, sorry sir you can&#039;t <br />do that here! You have to go to the other Bank for this :)&quot; The man, visibly confused leaves, but dosen&#039;t take the document with him. The coworker, now just as confused as the Guy actually Takes Out his glases and reads the hand written part: This is a <br />robbery gay-jesus-probably: Can you imagine trying to rob a god damn bank and the teller just cheerfully tells you to go rob the competition instead\" loading=\"eager\" /><br />this is no longer a robbery</div></div>",
  "source": {
    "content": "[share author='Another+Angry+Woman' profile='https://masto.ai/@stavvers' avatar='https://scottstolz.com/photo/2cc2db21-0c6b-4f8b-b288-fc3ba306ae63-6' link='https://masto.ai/@stavvers/109743922413395871' auth='false' posted='2023-01-25 10:05:10' message_id='https://masto.ai/users/stavvers/statuses/109743922413395871'][img=https://s3.masto.ai/media_attachments/files/109/743/909/795/295/144/original/f1c34ad0b539cbb2.png]Back at the window the teller notices his name on the withdrawal slip doesn&#039;t match the name on the account so she asks forhis ID. He once again tells her all the relevant info is on the folded note but also gives her his ID and says it&#039;s his dad&#039;s \naccount. She tells him he will need a check from his dad to get cash. He grabs the noteand leaves. Two new robbery notifications hit our emails, both branches within a mile. It&#039;s our guy. Security department is notified as are local police and the FBI. \nThe FBI comes over believing that these poor tellershad been robbed for the 3rd time in a month and take her statement. She is completely embarrassed telling them how everything went down and he kept signaling to the note and telling her to read it but \nshe was Just done. To which this FBI agent of 40 years who has been to the scene of many bank robberies (several at this branch i recent weeks) says: Ok. Let me see f I got this right, he came in fully intending to rob you. He gave you the note andyou \nJust..refused to read it? So he left and went o the bank literally across the street, handed them the exact same note, and they Just handed him five grand? Do I have that correct?” Her: I am so embarrassed FBI: this is best thing | have ever heard. He \neven handed you his ID! Holy- Her: I feel so dumb! FBI: don&#039;t! This s thebest thing I have ever heard. This is going to be in training courses. (He sat there giddy for at least 5 more minutes)[/img]\r\n[img=https://s3.masto.ai/media_attachments/files/109/743/904/596/287/946/original/5333a204612b8042.png]theprofessional-amateur: I worked as a bank teller for several years and a few things you should know, bank robberies happen far more frequently than you might think and they come in waves. When a bank gets robbed a notification with photos goes to all \nbanks in the area to be on the lookout. And there are two kinds of robbery, the pass the note and the takeover (what you see in movies). So our branch had had a big takeover robbery as well as a note one. We also had a teller that had transferred to our \nbranch after having been through a robbery. Shewas sweet as apple pie, hair up to the ceiling, southern lady who had just been through multiple robberies. A guy comes in and hands her a folded note. Her immediate thought was “this guy needs to learn \nyou don’t hand bank tellers notes. | am just not going to read that” So how the conversation goes: Her: how can I help you today? Him: I&#039;m here to get money Her: great *hands him a withdrawal slip Him: all the information is on the paper Her: to \nprocess the transaction I need you to put it on my piece of paper SO HE FILLS OUT A WITHDRAWAL SLIP. Meanwhile another coworker is looking at her latest robbery notification email thinking the guy at the window looks a lot like him but the teller is calm \nand seems to be following standard transaction.[/img]\r\n[img=https://s3.masto.ai/media_attachments/files/109/743/838/783/142/620/original/58a22d1c6326e34e.jpeg]juicedoesthings: Remember if you&#039;re out at a store and someone says “This is a robbery” you can say “no it’s not” and then the robber will leave because theyre a robber and this is no longer a robbery juicedoesthings: screenshotted tags from \nalonelybeemakingart #This is obviously a joke but #a coworker of my father kinda did this #(unintentionally) #And it worked You can not just say this without dropping the whole story alonelybeemakingart: Ok so, My dads coworker isat the front and this \nman comes Up and hands him a document. The coworker took a Look at the document and while he couldn&#039;t read the things written by Hand, because he wasn&#039;t wearing his glases, he did notice the Logo of a different Bank so he&#039;s like: &quot;Oh, sorry sir you can&#039;t \ndo that here! You have to go to the other Bank for this :)&quot; The man, visibly confused leaves, but dosen&#039;t take the document with him. The coworker, now just as confused as the Guy actually Takes Out his glases and reads the hand written part: This is a \nrobbery gay-jesus-probably: Can you imagine trying to rob a god damn bank and the teller just cheerfully tells you to go rob the competition instead[/img]\r\nthis is no longer a robbery[/share]",
    "mediaType": "text/bbcode"
  },
  "actor": "https://scottstolz.com/channel/scott",
  "to": [
    "https://www.w3.org/ns/activitystreams#Public"
  ],
  "attachment": [
    {
      "type": "Image",
      "url": "https://s3.masto.ai/media_attachments/files/109/743/838/783/142/620/original/58a22d1c6326e34e.jpeg",
      "name": "juicedoesthings: Remember if you&#039;re out at a store and someone says “This is a robbery” you can say “no it’s not” and then the robber will leave because theyre a robber and this is no longer a robbery juicedoesthings: screenshotted tags from \nalonelybeemakingart #This is obviously a joke but #a coworker of my father kinda did this #(unintentionally) #And it worked You can not just say this without dropping the whole story alonelybeemakingart: Ok so, My dads coworker is at the front and this \nman comes Up and hands him a document. The coworker took a Look at the document and while he couldn&#039;t read the things written by Hand, because he wasn&#039;t wearing his glases, he did notice the Logo of a different Bank so he&#039;s like: &quot;Oh, sorry sir you can&#039;t \ndo that here! You have to go to the other Bank for this :)&quot; The man, visibly confused leaves, but dosen&#039;t take the document with him. The coworker, now just as confused as the Guy actually Takes Out his glases and reads the hand written part: This is a \nrobbery gay-jesus-probably: Can you imagine trying to rob a god damn bank and the teller just cheerfully tells you to go rob the competition instead"
    },
    {
      "type": "Image",
      "url": "https://s3.masto.ai/media_attachments/files/109/743/904/596/287/946/original/5333a204612b8042.png",
      "name": "theprofessional-amateur: I worked as a bank teller for several years and a few things you should know, bank robberies happen far more frequently than you might think and they come in waves. When a bank gets robbed a notification with photos goes to all \nbanks in the area to be on the lookout. And there are two kinds of robbery, the pass the note and the takeover (what you see in movies). So our branch had had a big takeover robbery as well as a note one. We also had a teller that had transferred to our \nbranch after having been through a robbery. She was sweet as apple pie, hair up to the ceiling, southern lady who had just been through multiple robberies. A guy comes in and hands her a folded note. Her immediate thought was “this guy needs to learn \nyou don’t hand bank tellers notes. | am just not going to read that” So how the conversation goes: Her: how can I help you today? Him: I&#039;m here to get money Her: great *hands him a withdrawal slip Him: all the information is on the paper Her: to \nprocess the transaction I need you to put it on my piece of paper SO HE FILLS OUT A WITHDRAWAL SLIP. Meanwhile another coworker is looking at her latest robbery notification email thinking the guy at the window looks a lot like him but the teller is calm \nand seems to be following standard transaction."
    },
    {
      "type": "Image",
      "url": "https://s3.masto.ai/media_attachments/files/109/743/909/795/295/144/original/f1c34ad0b539cbb2.png",
      "name": "Back at the window the teller notices his name on the withdrawal slip doesn&#039;t match the name on the account so she asks for his ID. He once again tells her all the relevant info is on the folded note but also gives her his ID and says it&#039;s his dad&#039;s \naccount. She tells him he will need a check from his dad to get cash. He grabs the note and leaves. Two new robbery notifications hit our emails, both branches within a mile. It&#039;s our guy. Security department is notified as are local police and the FBI. \nThe FBI comes over believing that these poor tellers had been robbed for the 3rd time in a month and take her statement. She is completely embarrassed telling them how everything went down and he kept signaling to the note and telling her to read it but \nshe was Just done. To which this FBI agent of 40 years who has been to the scene of many bank robberies (several at this branch i recent weeks) says: Ok. Let me see f I got this right, he came in fully intending to robyou. He gave you the note and you \nJust..refused to read it? So he left and went o the bank literally across the street, handed them the exact same note, and they Just handed him five grand? Do I have that correct?” Her: I am so embarrassed FBI: this is best thing | have ever heard. He \neven handed you his ID! Holy- Her: I feel so dumb! FBI: don&#039;t! This s the best thing I have ever heard. This is going to be in training courses. (He sat there giddy for at least 5 more minutes)"
    }
  ],
  "cc": [
    "https://scottstolz.com/followers/scott"
  ],
  "signature": {
    "@context": [
      "https://www.w3.org/ns/activitystreams",
      "https://w3id.org/security/v1"
    ],
    "type": "RsaSignature2017",
    "nonce": "808e772e99bfa50ab1077fbe02d4888f15871b20d07af1db69c24dcc06e406b0",
    "creator": "https://scottstolz.com/channel/scott",
    "created": "2023-01-30T14:55:31Z",
    "signatureValue": "ExR4nhT1eLu96W5b5ZHXfSp6GoKS8TvW2za/1F4wApvt7/9lrKMVoU7saDPFbGyjkr7xuYXveuILxbTrB+e0yQN9HfMCivO7kann1vV+0MQSDHdNT9HpsLBspEcOKZ9Ur+iRiav93goYlMtC6dwwmOkGOw7L23UbyEBBvPYRWnRFyYoSnLiVzCUqESd1iDDdzQ39qHAtX0sg1dLAGKqhffUZ00ZwWPEUHMuii7eyPZZgOoSf31cYvd+Q54WWrwlG86ItTaSjaUsLeFemvduJnmRX9BUMWo658gRKv748xibqYZbktbg82HCZ2qEVTkvPo9W5EFD0N1lRoXgC7EyIkskYuq1PpDamE6amgwgXWJukGVdnlg0ctMTmB4dbB2RrfZ4HDqhfik+LUEde9mJheLlGT6OuTkr3Ie6B6njbQecUM44zX5gJa6pfMDdlcPgl824A6Dr+9Sg1FDwBXebDjGKao2qtQV7gWd8CEfBRM6XJBWNDcPPrJtM5PfpWbDj84xC0tSOJi+OK8A5KkyaH28NOMbIEXTW6FLdhhYgzAyCSEsQT0mH6EPu8UHEfEiXFZDEVlP8wSv4ysad/ri9Q4OcPcXfx4oW/cp9dSsdNxEAtr6cne/FMweLNhznWfk7oH2XSGeFIhJfLico5gpFBaL1jSDA4rJJOPy9OM7rPVWs="
  }
}
